import { TTableColumns } from "../types/table"

export const selectColumns = {
  "Последствие угрозы": ['-', 'K', "Ц", "Д"],
  "Тип ущерба": ['-', "У1", "У2", "У3", "У4", "У5"],
  "Ценность актива (величина ущерба)": ['0', '1', '2', '3', '4']
} as const

export const columns = [
  "Последствие угрозы",
  "Тип ущерба",
  "Ценность актива (величина ущерба)",
  "Примечание (возможные последствия)",
  "Размер ущерба",
  "Количество инцидентов в год",
  "Вероятность успешной реализации угрозы",
  "ALE1",
  "Вероятность после применения мер",
  "ALE2",
  "Стоимость защитных мер",
  "ROI"
] as const

export const defaultSubRow = columns.reduce<TTableColumns>((acc, v) => (
  { ...acc, [v]: '' }
), {} as TTableColumns)